from datetime import datetime
special_holidays = [
    datetime(2024, 5, 5).date(),
    datetime(2025, 1, 1).date()
]

workday = [
    "05:20", "06:10", "06:45", "07:15", "07:45", "08:15", "08:45", "09:15", "09:55", "10:35", "11:15", "11:55", "12:35", "13:25", "14:15", "15:00", "15:40", "16:20", "16:50", "17:20", "17:50", "18:40", "19:45",
    "05:40", "06:30", "07:00", "07:30", "08:00", "08:30", "09:00", "09:35", "10:15", "10:55", "11:35", "12:15", "13:00", "13:50", "14:40", "15:20", "16:00", "16:35", "17:05", "17:35", "18:10", "19:10"
]

holiday = [
    "05:20", "06:10", "07:10", "08:10", "09:10", "10:30", "12:00", "13:40", "15:20", "17:15",
    "05:40", "06:40", "07:40", "08:40", "09:50", "11:10", "12:50", "14:30", "16:20"
]
weekend = [
    "05:20", "06:10", "06:50", "07:30", "08:10", "08:50", "09:30", "10:10", "10:50", "11:30", "12:10", "12:50", "13:30", "14:10", "14:50", "15:35", "16:25", "17:15", "18:10", "19:10",
    "05:40", "06:30", "07:10", "07:50", "08:30", "09:10", "09:50", "10:30", "11:10", "11:50", "12:30", "13:10", "13:50", "14:30", "15:10", "16:00", "16:50", "17:40", "18:40", "19:45"
    ]

bus_arrival_times = {
    "Бронниця": {"Немії":0},
    "Нижній магазин": {"Немії":7},
    "П’ята колона": {"Немії":8},
    "Військова частина": {"Немії":11},
    "Консервний завод": {"Немії":12, "Бронниці":62},
    "119-й район": {"Немії":14, "Бронниці":60},
    "Магазин «Ельф», Прибори": {"Немії":16, "Бронниці":58},
    "Школа № 3, Полкова церква": {"Немії":18, "Бронниці":57},
    "Проспект Незалежності": {"Немії":20, "Бронниці":54},
    "Площа ім. Гоголя": {"Немії":22, "Бронниці":53},
    "Центр, Укрпошта": {"Немії":24, "Бронниці":50},
    "Ринок": {"Немії":26, "Бронниці":48},
    "Ощадбанк": {"Немії":28, "Бронниці":45},
    "Монтажний технікум": {"Немії":29, "Бронниці":43},
    "Машинобудівний завод": {"Немії":30, "Бронниці":42},
    "Школа № 5, Нова пошта": {"Немії":32, "Бронниці":41},
    "Лікарня": {"Немії":33, "Бронниці":38},
    "Верхня Немія": {"Залізничного вокзалу":37, "Лікарні":34},
    "Залізничний вокзал": {"Бронниці":38, "Немії":33},
    "Маслозавод": {"Бронниці":42, "Немії":31},
    "Автовокзал": {"Бронниці":43, "Немії":30},
    "Школа № 2": {"Бронниці":45, "Немії":28},
    "Пристань, «Вацак»": {"Бронниці":52},
    }

